KazzL/Blogging-Projects/Temperature_Logging_MSP4305529_Plotly/MSP430F5529 + CC3100 to Plotly.c
/*
 * ASYNCHRONOUS EVENT HANDLERS -- Start
 */
/*!
    \brief This function handles WLAN events

    \param[in]      pWlanEvent is the event passed to the handler

    \return         None

    \note

    \warning
*/
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pWlanEvent)//TODO: Look at all the possible events that can occur and decide if other events need to be handled
{
    switch(pWlanEvent->Event)
    {
        case SL_WLAN_CONNECT_EVENT:
        {
        	SET_STATUS_BIT(g_Status, STATUS_BIT_CONNECTION);
            intToChars(pWlanEvent->Event, errorArray);
        	CLI_Write(" STATUS_BIT_CONNECTION Value: ");
        	CLI_Write(errorArray);
        	CLI_Write("\r\n\r\n");
        	clearErrorArray();
            /*
             * Information about the connected AP (like name, MAC etc) will be
             * available in 'sl_protocol_wlanConnectAsyncResponse_t' - Applications
             * can use it if required
             *
             * sl_protocol_wlanConnectAsyncResponse_t *pEventData = NULL;
             * pEventData = &pWlanEvent->EventData.STAandP2PModeWlanConnected;
             *
             */
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            sl_protocol_wlanConnectAsyncResponse_t*  pEventData = NULL;

            CLR_STATUS_BIT(g_Status, STATUS_BIT_CONNECTION);
			CLR_STATUS_BIT(g_Status, STATUS_BIT_IP_AQUIRED);

            pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

            /* If the user has initiated 'Disconnect' request, 'reason_code' is
             * SL_USER_INITIATED_DISCONNECTION */
            if(SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code)//TODO: Add connection flag here to be checked in main loop and reconnect should a connection error occur
            {
            	CLI_Write(" Device disconnected from the AP on application's request \n\r");
            	intToChars(pWlanEvent->Event, errorArray);
				CLI_Write(" Error Code A.0: ");
				CLI_Write(errorArray);
				CLI_Write("\r\n\r\n");
				clearErrorArray();
				connectedToAP = 0;
				intToChars(pEventData->reason_code, errorArray);
				CLI_Write(" Error Code A.1: ");
				CLI_Write(errorArray);
				CLI_Write("\r\n\r\n");
				clearErrorArray();
            }
            else
            {
            	CLI_Write(" Device disconnected from the AP on an ERROR..!! \n\r");
            	connectedToAP = 0;
				intToChars(pWlanEvent->Event, errorArray);
				CLI_Write(" Error Code A.2: ");
				CLI_Write(errorArray);
				CLI_Write("\r\n\r\n");
				clearErrorArray();
				connectedToAP = 0;
				intToChars(pEventData->reason_code, errorArray);
				CLI_Write(" Error Code A.3: ");
				CLI_Write(errorArray);
				CLI_Write("\r\n\r\n");
				clearErrorArray();
            }
        }
        break;

        default:
        {
        	CLI_Write(" [WLAN EVENT] Unexpected event \n\r");
        	connectedToAP = 0;
			intToChars(pWlanEvent->Event, errorArray);
			CLI_Write(" Error Code B: ");
			CLI_Write(errorArray);
			CLI_Write("\r\n\r\n");
			clearErrorArray();
        }
        break;
    }
}

/*!
    \brief This function handles events for IP address acquisition via DHCP
           indication

    \param[in]      pNetAppEvent is the event passed to the handler

    \return         None

    \note

    \warning
*/
void SimpleLinkNetAppEventHandler(SlNetAppEvent_t *pNetAppEvent)
{
    switch(pNetAppEvent->Event)
    {
        case SL_NETAPP_IPV4_ACQUIRED:
        {
        	SET_STATUS_BIT(g_Status, STATUS_BIT_IP_AQUIRED);

            intToChars(pNetAppEvent->Event, errorArray);
        	CLI_Write(" Event Value: ");
        	CLI_Write(errorArray);
        	CLI_Write("\r\n\r\n");
        	clearErrorArray();

			
        	intToChars(STATUS_BIT_IP_AQUIRED, errorArray);
			CLI_Write(" STATUS_BIT_IP_AQUIRED Value: ");
			CLI_Write(errorArray);
			CLI_Write("\r\n\r\n");
			clearErrorArray();
            /*
			 * Information about the connection (like IP, gateway address etc)
			 * will be available in 'SlIpV4AcquiredAsync_t'
			 * Applications can use it if required
			 *
			 * SlIpV4AcquiredAsync_t *pEventData = NULL;
			 * pEventData = &pNetAppEvent->EventData.ipAcquiredV4;
			 *
			 */
        }
        break;

        default:
        {
        	CLI_Write(" [NETAPP EVENT] Unexpected event \n\r");
            intToChars(pNetAppEvent->Event, errorArray);
            CLI_Write(" Error Code C: ");
        	CLI_Write(errorArray);
        	CLI_Write("\r\n\r\n");
        	clearErrorArray();
        }
        break;
    }
}

/*!
    \brief This function handles callback for the HTTP server events

    \param[in]      pServerEvent - Contains the relevant event information
    \param[in]      pServerResponse - Should be filled by the user with the
                    relevant response information

    \return         None

    \note

    \warning
*/
void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pHttpEvent,
                                  SlHttpServerResponse_t *pHttpResponse)
{
    /* Unused in this application */
	CLI_Write(" [HTTP EVENT] Unexpected event \n\r");
}

/*!
    \brief This function handles general error events indication

    \param[in]      pDevEvent is the event passed to the handler

    \return         None
*/
void SimpleLinkGeneralEventHandler(SlDeviceEvent_t *pDevEvent)
{
    /*
     * Most of the general errors are not FATAL are are to be handled
     * appropriately by the application
     */
	CLI_Write(" [GENERAL EVENT] \n\r");
	intToChars(pDevEvent->Event, errorArray);
	CLI_Write(" Error Code D: ");
	CLI_Write(errorArray);
	CLI_Write("\r\n\r\n");
	clearErrorArray();
}

/*!
    \brief This function handles socket events indication

    \param[in]      pSock is the event passed to the handler

    \return         None
*/
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
	switch( pSock->Event )
	{
		case SL_NETAPP_IPV4_ACQUIRED:
			//TODO: Fill in needed code here (set flag)
		break;
		case SL_NETAPP_SOCKET_TX_FAILED:
			/*
			 * TX Failed
			 *
			 * Information about the socket descriptor and status will be
			 * available in 'SlSockEventData_t' - Applications can use it if
			 * required
			 *
			 * SlSockEventData_t *pEventData = NULL;
			 * pEventData = & pSock->EventData;
			 */
			switch( pSock->EventData.status )
			{
				case SL_ECLOSE:
					CLI_Write(" [SOCK EVENT] Close socket operation failed to transmit all queued packets\n\r");
					connetcedToSocket = 0;
					intToChars(pSock->Event, errorArray);
					CLI_Write(" Error Code E: ");
					CLI_Write(errorArray);
					CLI_Write("\r\n\r\n");
					clearErrorArray();
					break;
				default:
					CLI_Write(" [SOCK EVENT] Unexpected event 1\n\r");
					connetcedToSocket = 0;
					intToChars(pSock->Event, errorArray);
					CLI_Write(" Error Code F: ");
					CLI_Write(errorArray);
					CLI_Write("\r\n\r\n");
					clearErrorArray();
					break;
			}
			break;

		default:
			CLI_Write(" [SOCK EVENT] Unexpected event 2\n\r");
			connetcedToSocket = 0;
			intToChars(pSock->Event, errorArray);
			CLI_Write(" Error Code G: ");
			CLI_Write(errorArray);
			CLI_Write("\r\n\r\n");
			clearErrorArray();
			break;
	}
}
/*
 * ASYNCHRONOUS EVENT HANDLERS -- End
 */
void clearErrorArray(){
	char i;
	for(i = 0; i < 12; i++){
		errorArray[i] = '\0';
	}
}

/*!
    \brief This function configure the SimpleLink device in its default state. It:
           - Sets the mode to STATION
           - Configures connection policy to Auto and AutoSmartConfig
           - Deletes all the stored profiles
           - Enables DHCP
           - Disables Scan policy
           - Sets Tx power to maximum
           - Sets power policy to normal
           - Unregisters mDNS services

