KazzL/Blogging-Projects/Temperature_Logging_MSP4305529_Plotly/MSP430F5529 + CC3100 to Plotly.c
    CLI_Write(" - Initiating message transmit\n\r");
	while((sent == -1) && (i < 6)){
		Status = sl_Send(socketID, message, length, 0 );
		sent = Status;
		i++;
		if (sent != 0){
			for (j = 0; j < 1000; j++);
		}
	}
    if( Status < 0 )
	{
		CLI_Write(" Error while sending the data \n\r");
		sl_Close(socketID);
		return -1;
	}
	CLI_Write(" - Message transmitted\n\r");

////    if (closeSocket == 1){
//    	sl_Close(socketID);//TODO: Remove close socket
////    }
    return 0;
}


/*!
    \brief This function initializes the application variables

    \param[in]  None

    \return     0 on success, negative error-code on error
*/
static INT32 initializeAppVariables()
{
    g_Status = 0;
    memset(uBuf.BsdBuf, 0, sizeof(uBuf));

    return SUCCESS;
}
/*!
    \brief This function displays the application's banner

    \param      None

    \return     None
*/
static void displayBanner()
{
    CLI_Write("\n\r\n\r");
    CLI_Write(" TCP socket application - Version ");
    CLI_Write(APPLICATION_VERSION);
    CLI_Write("\n\r*******************************************************************************\n\r");
}

int intToChars(int number, char* chars){
	int val = number;
	int i = 0;
	int j = 0;
	int num;
	int neg = 0;
	char temp;
	if (val < 0){
		val = 0 - val;
		neg = 1;
	}

	if (val == 0){
		chars[0] = '0';
		i = 1;
	}

	while(val != 0){
		num = val/10;
		chars[i] = (char)(val - (num * 10) + 0x30);
		val = num;
		i++;
	}
	i--;//Remove extra count
	int f;
	if (i % 2 != 0){
		f = i / 2 + 1;
	}
	else {
		f = i / 2;
	}
	for (j = 0; j < f; j++){
		temp = chars[j];
		chars[j] = chars[i - j];
		chars[i - j] = temp;
	}
	if (neg){
		for (j = i; j >= 0; j--){
			chars[j + 1] = chars[j];
		}
		chars[0] = '-';
		i++;//increase count to account for negitive sign
	}
	return i + 1; //Counting from zero so add one for true length
}

//Converts Hex representation to characters
int charToInt(signed char value){
	int mambo = 0;
	if (value < 0){
		value = 0 - value;
		mambo = 0 - (int)value;
	}
	else{
		mambo = (int)value;
	}
	return mambo;
}

void hexByteToChar(char byteIn, char* nibbleA, char* nibbleB)
{
	switch(byteIn & 0xF0){
		case 0x0:
			*nibbleA = '0';
			break;
		case 0x10:
			*nibbleA = '1';
			break;
		case 0x20:
			*nibbleA = '2';
			break;
		case 0x30:
			*nibbleA = '3';
			break;
		case 0x40:
			*nibbleA = '4';
			break;
		case 0x50:
			*nibbleA = '5';
			break;
		case 0x60:
			*nibbleA = '6';
			break;
		case 0x70:
			*nibbleA = '7';
			break;
		case 0x80:
			*nibbleA = '8';
			break;
		case 0x90:
			*nibbleA = '9';
			break;
		case 0xA0:
			*nibbleA = 'A';
			break;
		case 0xB0:
			*nibbleA = 'B';
			break;
		case 0xC0:
			*nibbleA = 'C';
			break;
		case 0xD0:
			*nibbleA = 'D';
			break;
		case 0xE0:
			*nibbleA = 'E';
			break;
		case 0xF0:
			*nibbleA = 'F';
			break;
	}
	switch (byteIn & 0x0F){
		case 0x00:
			*nibbleB = '0';
			break;
		case 0x01:
			*nibbleB = '1';
			break;
		case 0x02:
			*nibbleB = '2';
			break;
		case 0x03:
			*nibbleB = '3';
			break;
		case 0x04:
			*nibbleB = '4';
			break;
		case 0x05:
			*nibbleB = '5';
			break;
		case 0x06:
			*nibbleB = '6';
			break;
		case 0x07:
			*nibbleB = '7';
			break;
		case 0x08:
			*nibbleB = '8';
			break;
		case 0x09:
			*nibbleB = '9';
			break;
		case 0x0A:
			*nibbleB = 'A';
			break;
		case 0x0B:
			*nibbleB = 'B';
			break;
		case 0x0C:
			*nibbleB = 'C';
			break;
		case 0x0D:
			*nibbleB = 'D';
			break;
		case 0x0E:
			*nibbleB = 'E';
			break;
		case 0x0F:
			*nibbleB = 'F';
			break;
	}
}


int plotlyPlotString(int xVal, int yVal, char* dataStream){
	const char start[] = "\r\n{\"x\":";
	const char middle[] = ",\"y\":";
	const char end[] = "}\r\n";

//	char xValue[] = "\0\0\0\0\0\0";
	char yValue[] = "\0\0\0\0\0\0";

	intToChars(xVal, xValue);
	intToChars(yVal, yValue);

	int offset = 4;
	strncpy(dataStream + offset, start, sizeof(start) - 1);
	offset = offset + sizeof(start) - 1;
	strncpy(dataStream + offset, xValue, strlen(xValue));
	offset = offset + strlen(xValue);
	strncpy(dataStream + offset, middle, sizeof(middle) - 1);
	offset = offset + sizeof(middle) - 1;
	strncpy(dataStream + offset, yValue, strlen(yValue));
	offset = offset + strlen(yValue);
	strncpy(dataStream + offset, end, sizeof(end)); //Leave out the -1 inorder to include the null terminator

	int streamLength;
	char streamDataLen[] = "\0\0\0\0\0";

	streamLength = sizeof(start) - 2 + strlen(xValue) + sizeof(middle) + strlen(yValue) + sizeof(end) - 3;
	intToChars(streamLength, streamDataLen);
	char happyDay[4];
	hexByteToChar(streamDataLen[0], happyDay, happyDay + 1);
	hexByteToChar(streamDataLen[1], happyDay + 2, happyDay + 3);
	strncpy(dataStream, happyDay, 4);

	return streamLength;
}

void I2CInit(){
  WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT
  P4SEL |= 0x06;                            // Assign I2C pins to USCI_B0
  UCB1CTL1 |= UCSWRST;                      // Enable SW reset
  UCB1CTL0 = UCMST + UCMODE_3 + UCSYNC;     // I2C Master, synchronous mode
  UCB1CTL1 = UCSSEL_2 + UCSWRST;            // Use SMCLK, keep SW reset
  UCB1BR0 = 10;                             // fSCL = SMCLK/12 = ~100kHz
  UCB1BR1 = 0;
  UCB1I2CSA = 0x60;                         // Slave Address is 048h
  UCB1CTL1 &= ~UCSWRST;                     // Clear SW reset, resume operation
  UCB1IE |= UCTXIE;                         // Enable TX interrupt
  UCB1IE |= UCRXIE;                         // Enable RX interrupt
}

void I2CTx(unsigned char* TxData, unsigned char numBytes, char stop){
    unsigned int i;
    stopBit = stop;
	for(i=0;i<10;i++);                      // Delay required between transaction
    PTxData = (unsigned char *)TxData;      // TX array start address
                                            // Place breakpoint here to see each
                                            // transmit operation.
    TXByteCtr = numBytes;              // Load TX byte counter

    UCB1CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition

    __bis_SR_register(LPM0_bits + GIE);     // Enter LPM0, enable interrupts
    __no_operation();                       // Remain in LPM0 until all data

