KazzL/Blogging-Projects/Temperature_Logging_MSP4305529_Plotly/MSP430F5529 + CC3100 to Plotly.c
    if(stop){
    	UCB1CTL1 |= UCTXSTP;
    }
                                            // is TX'd
    while (UCB1CTL1 & UCTXSTP);             // Ensure stop condition got sent
}

void I2CRx(unsigned char* RxBuffer, unsigned char numBytes){
	PRxData = (unsigned char *)RxBuffer;    // Start of RX buffer
    RXByteCtr = numBytes;                   // Load RX byte counter
    if (numBytes > 1){
    	multiple = 1;
    }
    else {
    	multiple = 0;
    }
    while (UCB1CTL1 & UCTXSTP);           // Ensure stop condition got sent

    UCB1CTL1 &= ~UCTR;
    UCB1CTL1 |= UCTXSTT;                    // I2C start condition

    if (multiple == 0){
		while(UCB1CTL1 & UCTXSTT);          // Start condition sent?
		UCB1CTL1 |= UCTXSTP;
    }
    __bis_SR_register(LPM0_bits + GIE);     // Enter LPM0, enable interrupts
                                            // Remain in LPM0 until all data is RX'd
    __no_operation();
}

int mpl3115aInit(){
	char initialized = 1;

	unsigned char WHO_AM_I[] = {0x0C};
	unsigned char CTRL_REG1_SET1[] = {0x26, 0x38};
	unsigned char CTRL_REG2_SET[] = {0x27, 0x00};
	unsigned char CTRL_REG3_SET[] = {0x28, 0x11};
	unsigned char CTRL_REG4_SET[] = {0x29, 0x00};
	unsigned char CTRL_REG5_SET[] = {0x2A, 0x00};
	unsigned char PT_DATA_CFG_SET[] = {0x13, 0x07};

	unsigned char CTRL_REG1_GET[] = {0x26};
	unsigned char CTRL_REG1_SET2[] = {0x26, 0x39};
	unsigned char CTRL_REG2_GET[] = {0x27};

	I2CTx(WHO_AM_I, sizeof(WHO_AM_I), FALSE);
	I2CRx(RxBuffer, 1);
	if (RxBuffer[0] == 0xC4){
		P4OUT |= 0x80;
		P1OUT &= 0xFE;
	}
	else {
		P1OUT |= 0x01;
		P4OUT &= 0x7F;
		initialized = 0;
	}

	I2CTx(CTRL_REG1_SET1, sizeof(CTRL_REG1_SET1), TRUE);
	I2CTx(CTRL_REG2_SET, sizeof(CTRL_REG2_SET), TRUE);
	I2CTx(CTRL_REG3_SET, sizeof(CTRL_REG3_SET), TRUE);
	I2CTx(CTRL_REG4_SET, sizeof(CTRL_REG4_SET), TRUE);
	I2CTx(CTRL_REG5_SET, sizeof(CTRL_REG5_SET), TRUE);
	I2CTx(PT_DATA_CFG_SET, sizeof(PT_DATA_CFG_SET), TRUE);

	I2CTx(CTRL_REG1_GET, sizeof(CTRL_REG1_GET), FALSE);
	I2CRx(RxBuffer, 1);
	if (RxBuffer[0] == 0x38){
		P4OUT |= 0x80;
		P1OUT &= 0xFE;
	}
	else {
		P1OUT |= 0x01;
		P4OUT &= 0x7F;
		initialized = 0;
	}

	I2CTx(CTRL_REG1_SET2, sizeof(CTRL_REG1_SET2), TRUE);
	I2CTx(CTRL_REG1_GET, sizeof(CTRL_REG1_GET), FALSE);
	I2CRx(RxBuffer, 1);
	if (RxBuffer[0] == 0x39){
		P4OUT |= 0x80;
		P1OUT &= 0xFE;
	}
	else {
		P1OUT |= 0x01;
		P4OUT &= 0x7F;
		initialized = 0;
	}

	I2CTx(CTRL_REG2_GET, sizeof(CTRL_REG2_GET), FALSE);
	I2CRx(RxBuffer, 1);
	if (RxBuffer[0] == 0x00){
		P4OUT |= 0x80;
		P1OUT &= 0xFE;
	}
	else {
		P1OUT |= 0x01;
		P4OUT &= 0x7F;
		initialized = 0;
	}
	return initialized;
}

int mpl3115aRead(){
	unsigned char OUT_P_MSB[] = {0x01};
	unsigned char DR_STATUS[] = {0x06};

	char readPresTemp = 0;

	I2CTx(DR_STATUS, sizeof(DR_STATUS), FALSE);
	I2CRx(RxBuffer, 1);
	if ((RxBuffer[0] == 0x0E) || (RxBuffer[0] == 0xEE)){
		P4OUT |= 0x80;
		P1OUT &= 0xFE;
		readPresTemp = 1;
	}
	else {
		P1OUT |= 0x01;
		P4OUT &= 0x7F;
		readPresTemp = 0;
	}

	if (readPresTemp){
		I2CTx(OUT_P_MSB, sizeof(OUT_P_MSB), FALSE);
		I2CRx(RxBuffer, 5);
		Delay(50);
	}
	return readPresTemp;
}





int main(void)
{
	INT32 retVal = -1;
	int temperatureInt;
	int streamLength;
	int packetLength;
	char dataStream[30];
	int xVal = 0;

	P1OUT &= 0xFE;
 	P1DIR |= 0x01;
	P4OUT &= 0x7F;
	P4DIR |= 0x80;

	retVal = initializeAppVariables();
	ASSERT_ON_ERROR(__LINE__, retVal);

	stopWDT();
	initClk();

	CLI_Configure();
    CLI_Write(" \f\r\n");

	displayBanner();
/*****************************************************TEST FUNCTIONS START*******************************/
	configureCC3x00();
	startCC3x00();
	connectCC3x00();

/*****************************************************TEST FUNCTIONS END*******************************/

 	INT16 socketIDD;
 	socketIDD = BsdTcpClient(PORT_NUM);

//	unsigned char PLOTLY[] = 	 "POST /clientresp HTTP/1.1\r\nHost: 107.21.214.199\r\nUser-Agent: MSP430F5529/0.5.1\r\nContent-Length: 261\r\n\r\nversion=2.2&origin=plot&platform=Stellaris&un=Kas&key=123456789k&args=[{\"y\": [], \"x\": [], \"type\": \"scatter\", \"stream\": {\"token\": \"ABCDEFGHI\", \"maxpoints\": 7200}}]&kwargs={\"fileopt\": \"overwrite\", \"filename\": \"Element14 Temperature Plot\", \"world_readable\": true}\r\n";
// 	unsigned char initPlotly[] = "POST /clientresp HTTP/1.1\r\nHost: 107.21.214.199\r\nUser-Agent: MSP430F5529/0.5.1\r\nContent-Length: 243\r\n\r\n";
//  unsigned char initStream[] = "version=2.2&origin=plot&platform=Stellaris&un=Kas&key=123456789&args=[{\"y\": [], \"x\": [], \"type\": \"scatter\", \"stream\": {\"token\": \"ABCDEFGHI\", \"maxpoints\": 500}}]&kwargs={\"fileopt\": \"overwrite\", \"filename\": \"test plot\", \"world_readable\": true}\r\n\r\n\r\n\r\n\r\n";
    unsigned char openStream[] = "POST / HTTP/1.1\r\nHost: stream.plot.ly\r\nUser-Agent: Python\r\nTransfer-Encoding: chunked\r\nConnection: keep-alive\r\nplotly-streamtoken: ABCDEFGHI\r\n\r\n";

 	packetTx(socketIDD, openStream, (sizeof(openStream) - 1), 0);

 	int dataAvilable;

 	CLI_Write(" Initilizing I2C");
 	I2CInit();
 	Delay(700);
 	CLI_Write(" Complete \r\n");
 	Delay(500);
 	CLI_Write(" Initilizing MPL3115A");
 	mpl3115aInit();
 	Delay(700);
 	CLI_Write(" Complete\r\n");
	while (1)
  {
		dataAvilable = mpl3115aRead();
		if (dataAvilable == 1){

			temperatureInt = charToInt((signed char)RxBuffer[3]);
			streamLength = plotlyPlotString(xVal, temperatureInt, dataStream);
			packetLength = streamLength + 6;
			packetTx(socketIDD, dataStream, packetLength, 0);

			CLI_Write("\r\n");
			CLI_Write(dataStream);
			CLI_Write("\r\n");

			xVal++;
		}
		Delay(20);
  }
}






//-------------------------------------------------------------------------------
// The USCI_B0 data ISR is used to move received data from the I2C slave
// to the MSP430 memory. It is structured such that it can be used to receive
// any 2+ number of bytes by pre-loading RXByteCtr with the byte count.
//-------------------------------------------------------------------------------
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B1_VECTOR
__interrupt void USCI_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B0_VECTOR))) USCI_B0_ISR (void)
#else
#error Compiler not supported!
#endif
{
  switch(__even_in_range(UCB1IV,12))
  {
  case  0: break;                           // Vector  0: No interrupts
  case  2: break;                           // Vector  2: ALIFG
  case  4: break;                           // Vector  4: NACKIFG
  case  6: break;                           // Vector  6: STTIFG
  case  8: break;                           // Vector  8: STPIFG
  case 10:                                  // Vector 10: RXIFG
    RXByteCtr--;                            // Decrement RX byte counter
    if (RXByteCtr)
    {
      *PRxData++ = UCB1RXBUF;               // Move RX data to address PRxData
      if (RXByteCtr == 1 && multiple == 1)                   // Only one byte left?
        UCB1CTL1 |= UCTXSTP;                // Generate I2C stop condition
    }
    else
    {
      *PRxData = UCB1RXBUF;                 // Move final RX data to PRxData
      __bic_SR_register_on_exit(LPM0_bits); // Exit active CPU
    }
    break;
  case 12:                                  // Vector 12: TXIFG
    if (TXByteCtr)                          // Check TX byte counter
    {
      UCB1TXBUF = *PTxData++;               // Load TX buffer
      TXByteCtr--;                          // Decrement TX byte counter
    }
    else
    {
    if (stopBit){
      UCB1CTL1 |= UCTXSTP;                  // I2C stop condition						//Set a stop flag if this should be sent out or not
    }
      UCB1IFG &= ~UCTXIFG;                  // Clear USCI_B0 TX int flag
      __bic_SR_register_on_exit(LPM0_bits); // Exit LPM0
    }
  default: break;
  }
}



